# AngularDimensionsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BendingDetailCustomFieldProperties..::..AngularDimensionsEnabled Property
BendingDetailCustomFieldProperties Class See Also
---
Identifies if any angular dimensions will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool AngularDimensionsEnabled { get; set; }
```

Visual Basic
---
```text
Public Property AngularDimensionsEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AngularDimensionsEnabled {
	bool get ();
	void set (bool value);
}
```

# See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace